app/controllers/plants_controller.rb

  def create
    @plant = Plant.new(plant_params)

    respond_to do |format|
      if @plant.save
---
INSERT INTO "plants" ("name", "category", "last_watered", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Elisa"], ["category", "Cacti"], ["last_watered", "2000-01-01 12:26:00"], ["created_at", "2022-04-10 15:26:23.761776"], ["updated_at", "2022-04-10 15:26:23.761776"]]